app/views/videos/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <div class="col-md-3 text-center"><%= f.label :category %></div>
    <%= f.collection_select(:category_id, Category.all, :id, :name) %>

SELECT "subcategories".* FROM "subcategories"
---
    <div class="col-md-3 text-center"><%= f.label :subcategory %></div>
    <%= f.collection_select(:subcategory, Subcategory.all, :id, :subcategory_name) %>

SELECT "statuses".* FROM "statuses"
---
    <div class="col-md-3 text-center"><%= f.label :status %></div>
    <%= f.collection_select(:status, Status.all, :name, :name) %>