app/controllers/api/v1/videos_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."video_id" = $1  [["video_id", 2]]
SELECT "videos".* FROM "videos"
---
  def index
    @videos = Video.all.page(params[:page]).per(10).order('created_at DESC')
    #render json: @videos
     render :json => @videos.map { |video| {:name => video.name, :rating => video.rating, :category => video.category.name , :language => video.language, :tags => video.tags, :description => video.description, :duration => video.duration, :thumbnail => video.tumbnail, :video_file => video.video} }

SELECT  "videos".* FROM "videos" ORDER BY created_at desc LIMIT $1  [["LIMIT", 2]]
SELECT "videos".* FROM "videos" WHERE "videos"."id" IN (NULL, NULL)
---
  def limit
    @videos = Video.all.limit(2).order('created_at desc')
    render :json => @videos.map { |video| {:name => video.name, :rating => video.rating, :category => video.category.name , :language => video.language, :tags => video.tags, :description => video.description, :duration => video.duration, :thumbnail => video.tumbnail, :video_file => video.video} }

SELECT COUNT(*) FROM "videos" WHERE (name LIKE '%yz%')
SELECT "videos".* FROM "videos" WHERE (name LIKE '%geo%')
---
  def search
    search = params[:name]
    @videos = Video.page(params[:page]).per(10).order('created_at DESC').where("name LIKE ?" ,"%#{search}%")
    if !@videos.empty?

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_video
      @video = Video.find(params[:id])