app/views/user/role.html.erb


	<%= f.collection_select(:role, Role.all, :name, :name) %>
---
SELECT "roles".* FROM "roles"