app/controllers/home_controller.rb

def view
    @videos = Video.all
---
SELECT "videos".* FROM "videos"