app/controllers/subcategories_controller.rb

  def index
    @subcategories = Subcategory.all
---
SELECT "subcategories".* FROM "subcategories"

  def create
    @subcategory = Subcategory.new(subcategory_params)

    respond_to do |format|
      if @subcategory.save
---
INSERT INTO "subcategories" ("category_id", "subcategory_name", "is_active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_id", 1], ["subcategory_name", "ploughing"], ["is_active", true], ["created_at", 2016-09-27 08:08:54 UTC], ["updated_at", 2016-09-27 08:08:54 UTC]]

  def destroy
    @subcategory.destroy
---
DELETE FROM "subcategories" WHERE "subcategories"."id" = $1  [["id", 1]]

    def set_subcategory
      @subcategory = Subcategory.find(params[:id])
---
SELECT  "subcategories".* FROM "subcategories" WHERE "subcategories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]