app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE (is_member = 't' AND is_admin = 't')
SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "member"]]
---
  def view
      if @current_user.role== "Admin"
      	@users = User.all
        elsif @current_user.role == "member"
          @users = User.where(role: "user").all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def role
  	@id = params[:id]
   @users = User.find(@id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", "member"], ["updated_at", 2016-09-23 09:58:39 UTC], ["id", 1]]
---
  def update_role
  	@users = User.all
  	@uid = params[:user][:userid]
	 @users = User.find_by_id!(@uid)
			    if @users.update_attributes(user_params)

SELECT "roles".* FROM "roles"
---
  def role_permissions
    @roles = Role.all