app/controllers/videos_controller.rb

  def create
    @video = Video.new(video_params)
    @video.uid = params[:video][:uid]
    respond_to do |format|
      if @video.save
---
INSERT INTO "videos" ("name", "rating", "category", "subcategory", "language", "tags", "description", "uid", "status", "duration", "url_name", "tumbnail", "video", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

  def destroy
    @video.destroy
---
DELETE FROM "videos" WHERE "videos"."id" = $1  [["id", 2]]

    def set_video
      @video = Video.find(params[:id])
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]